<?php
$detailedAnswers = [
    [
        'A' => 'Четкий план и система отслеживания прогресса',
        'B' => 'Поддержка друзей или сообщества единомышленников',
        'C' => 'Вдохновляющая цель, к которой я стремлюсь',
        'D' => 'Удовольствие и комфорт в процессе',
    ],
    [
        'A' => 'Анализирую причины и корректирую план на будущее',
        'B' => 'Делюсь своими трудностями с другом или сообществом',
        'C' => 'Напоминаю себе о своих долгосрочных целях для новой мотивации',
        'D' => 'Проявляю к себе сострадание и продолжаю с того места, где остановился(ась)',
    ],
    [
        'A' => 'Разбить процесс на маленькие, измеримые шаги',
        'B' => 'Найти наставника или группу с общими интересами',
        'C' => 'Представить, как этот навык изменит мою жизнь к лучшему',
        'D' => 'Экспериментировать с разными подходами, пока не найду самый приятный',
    ],
    [
        'A' => 'Отслеживание прогресса и статистика достижений',
        'B' => 'Возможность поделиться успехами и получить обратную связь',
        'C' => 'Видеть, как я приближаюсь к своей большой цели',
        'D' => 'Встроить практику в свой образ жизни так, чтобы она стала естественной',
    ],
    [
        'A' => 'Структурированное, с четким планом и расписанием',
        'B' => 'Включает общение с близкими или просмотр вдохновляющего контента',
        'C' => 'Начинается с визуализации моих целей и достижений',
        'D' => 'Спокойное, с приятными ритуалами и моментами осознанности',
    ],
    [
        'A' => 'Нечеткие цели или отсутствие плана',
        'B' => 'Чувство изоляции, отсутствие поддержки',
        'C' => 'Потеря связи между действиями и большой целью',
        'D' => 'Слишком строгие правила, вызывающие чувство ограничения',
    ],
    [
        'A' => 'Что измеримо, то выполнимо',
        'B' => 'Вместе мы сильнее',
        'C' => 'Мечтай о великом, действуй решительно',
        'D' => 'Прислушивайся к себе и двигайся в своем темпе',
    ],
    [
        'A' => 'Отмечаю в трекере привычек или приложении',
        'B' => 'Делюсь успехами с друзьями или в социальных сетях',
        'C' => 'Представляю, как это достижение приближает меня к моей мечте',
        'D' => 'Позволяю себе момент гордости и благодарности',
    ],
    [
        'A' => 'Планирование меню на неделю и подсчет калорий/нутриентов',
        'B' => 'Готовить вместе с друзьями или обмениваться рецептами',
        'C' => 'Фокус на то, как правильное питание поможет достичь желаемых целей',
        'D' => 'Интуитивное питание и внимание к тому, как разные продукты влияют на самочувствие',
    ],
    [
        'A' => 'Конкретность и измеримость результатов',
        'B' => 'Возможность делиться прогрессом с другими',
        'C' => 'Связь привычки с моими ценностями и большими целями',
        'D' => 'Получение удовольствия от самого процесса',
    ],
];
