<?php
$questions = [
    "Когда вы начинаете новую полезную привычку, что вам важнее всего?",
    "Как вы обычно реагируете, когда пропускаете запланированное занятие?",
    "Какой подход к изучению нового навыка вам ближе всего?",
    "Что больше всего помогает вам придерживаться регулярной практике?",
    "Как выглядит ваше идеальное утро?",
    "Что обычно мешает вам быть дисциплинированным(-ой)?",
    "Какая фраза лучше всего описывает ваш подход к саморазвитию?",
    "Как вы предпочитаете отмечать свои достижения?",
    "Какой подход к здоровому питанию вам ближе всего?",
    "Какой фактор наиболее важен для вас при формировании новой привычки?"
];
